// Lab_03_1.cpp
// < Бандрівський Денис Юрійович >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 1

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу

	cout << "x = "; cin >> x;

	A = 1 + (9 * x);

	// спосіб 1: розгалуження в скороченій формі

	if (x <= 0) 
	{
		// Обчислюємо вираз ln|sin(x)| + x^7
		B = log(abs(sin(x))) + pow(x,7);
	}

	if (x > 0 && x <= 3)
	{
		// Обчислюємо ctg(|x+1|/2)
		B = 1. / tan(abs(x + 1.) / 2.);
	}

	if (x > 3)
	{
		// Обчислюємо вираз 3x - x^5
		B = 3 * x - pow(x,5);
	}

	y = A + B;

	cout << endl << "1) y = " << y << endl;

	// спосіб 2: розгалуження в повній формі
	
	if (x <= 0)
	{
		// Обчислюємо вираз ln|sin(x)| + x^7
		B = log(abs(sin(x))) + pow(x, 7);
	}
	else
	{
		if (x > 0 && x <= 3)
		{
			// Обчислюємо ctg(|x+1|/2)
			B = 1. / tan(abs(x + 1.) / 2.);
		}
		else
		{
			// Обчислюємо вираз 3x - x^5
			B = 3. * x - pow(x, 5);
		}
	}
	y = A + B;
	cout << "2) y = " << y << endl;
	cin.get();
	return 0;
}
